tap "libsql/sqld", trusted: { formulae: ["sqld"] }
tap "tursodatabase/tap"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Arbitrary precision numeric processing language
brew "bc"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Open-source GitLab command-line tool
brew "glab"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
brew "tursodatabase/tap/turso", trusted: true
# Anthropic's official Claude AI desktop app
cask "claude"
cask "font-monaspice-nerd-font"
cask "font-noto-sans-symbols-2"
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Home media server
cask "plex-media-server"
npm "openclaw"
npm "vercel"
